app/controllers/admin/courses_controller.rb

  def index

    @courses = Course.all
---
SELECT * FROM `courses` WHERE (courses.status = 1)

  def show
    @course = Course.find(params[:id])
---
SELECT * FROM `courses` WHERE (`courses`.`id` = 1)

  def new
    @course = Course.new
    @course.sessions.build
    @course.instructor = Instructor.first
---
SELECT * FROM `instructors` LIMIT 1

  def edit
    @course = Course.find(params[:id])
---
SELECT * FROM `courses` WHERE (`courses`.`id` = 1)

  def create
    @course = Course.new(params[:course])

    respond_to do |format|
      if @course.save
---
INSERT INTO `courses` (`name`, `created_at`, `updated_at`, `teatcher`, `level`, `description`, `status`) VALUES('Morgonyoga', '2009-11-28 13:35:28', '2009-11-28 13:35:28', 'Jonas Höglund', 'alla', 'Starta dagen med en morgon yoga. Finns det något bättre?', 0)

  def update
    @course = Course.find(params[:id])

    respond_to do |format|
      if @course.update_attributes(params[:course])
---
SELECT * FROM `courses` WHERE (`courses`.`id` = 1)
UPDATE `courses` SET `updated_at` = '2009-11-28 13:32:46', `status` = 1 WHERE `id` = 1