app/controllers/admin/instructors_controller.rb

  def index
    @instructors = Instructor.all
---
SELECT * FROM `instructors`

  def show
    @instructor = Instructor.find(params[:id])
---
SELECT * FROM `instructors` WHERE (`instructors`.`id` = 1)

  def edit
    @instructor = Instructor.find(params[:id])
---
SELECT * FROM `instructors` WHERE (`instructors`.`id` = 1)

  def create
    @instructor = Instructor.new(params[:instructor])

    respond_to do |format|
      if @instructor.save
---
INSERT INTO `instructors` (`name`, `created_at`, `avatar_file_name`, `avatar_file_size`, `updated_at`, `avatar_content_type`, `phone`, `bio`, `description`, `avatar_updated_at`, `email`) VALUES('maria Distner', '2009-12-03 12:04:00', NULL, NULL, '2009-12-03 12:04:00', NULL, '0709961400', 'lorem', '', NULL, 'maria@naava.se')

  def update
    @instructor = Instructor.find(params[:id])

    respond_to do |format|
      if @instructor.update_attributes(params[:instructor])
---
SELECT * FROM `instructors` WHERE (`instructors`.`id` = 2)
UPDATE `instructors` SET `updated_at` = '2009-12-03 12:06:10', `avatar_file_size` = 2431848, `avatar_file_name` = 'DSC_0100.JPG', `avatar_updated_at` = '2009-12-03 12:06:08', `avatar_content_type` = 'image/jpeg' WHERE `id` = 2