app/controllers/admin/sessions_controller.rb

  def new
    @session = Session.new
    @cources = Course.all
---
SELECT * FROM `courses`