app/controllers/bookings_controller.rb

  def show
    @booking = Booking.active.find_by_token(params[:id])
---
SELECT * FROM `bookings` WHERE (`bookings`.`token` = '1dc18b180f6a9675ea3002bbb27032e92f53ffde') AND (bookings.status = 1) LIMIT 1

  def destroy
    @booking = Booking.active.find_by_token(params[:id])
    @booking.update_attribute(:status, Status::DISABLED)
---
SELECT * FROM `bookings` WHERE (`bookings`.`token` = '1dc18b180f6a9675ea3002bbb27032e92f53ffde') AND (bookings.status = 1) LIMIT 1
UPDATE `bookings` SET `updated_at` = '2009-12-01 19:01:20', `status` = 0 WHERE `id` = 31

  def paypal_ipn
    notify = Paypal::Notification.new(request.raw_post)
    if notify.acknowledge
      if notify.complete?
        @booking = Booking.find(notify.item_id)
---
SELECT * FROM `bookings` WHERE (`bookings`.`id` = 40) AND (bookings.status = 1)

  def paypal_success
    @booking = Booking.find_by_token(params[:id])
---
SELECT * FROM `bookings` WHERE (`bookings`.`token` = '3c1f678c2dde241a40b2e281873ffb3bc839672d') AND (bookings.status = 1) LIMIT 1

  def paypal_cancel
    @booking = Booking.find_by_token(params[:id])
---
SELECT * FROM `bookings` WHERE (`bookings`.`token` = 'd1b2680e82548f215cc2eb229a4f0796affca026') LIMIT 1