app/controllers/courses_controller.rb

  def index
    @courses = Course.active.all
---
SELECT * FROM `courses` WHERE (courses.status = 1)

  def show
    begin
      @course = Course.find(params[:id])
---
SELECT * FROM `courses` WHERE (`courses`.`id` = 1)

  def book
    @booker = Course.find(params[:id])
---
SELECT * FROM `courses` WHERE (`courses`.`id` = 1)