app/controllers/instructors_controller.rb

SELECT * FROM `instructors`
---
  def index
    @instructors = Instructor.all

SELECT * FROM `instructors` WHERE (`instructors`.`id` = 1)
---
  def show
    @instructor = Instructor.find(params[:id])