app/controllers/user_sessions_controller.rb

INSERT INTO `users` (`name`, `single_access_token`, `last_request_at`, `created_at`, `crypted_password`, `perishable_token`, `updated_at`, `failed_login_count`, `current_login_ip`, `password_salt`, `current_login_at`, `phone`, `persistence_token`, `login_count`, `last_login_ip`, `login`, `last_login_at`) VALUES('Jonas Höglund', '0UxvOKAES1gAOGiRGRez', NULL, '2009-11-27 11:04:01', '1d88ea9c1c5c6960cdea69043255f2e43ce49e20183131c8b20ec4d6d03074111f12f230e1e97eafa42e8da3927f864d2281291dd928a5124eff131daaacc937', 'GEhezRzPRMMcvUKUUv30', '2009-11-27 11:04:01', 0, NULL, 'tiCrc65bbFFbEgNklXow', NULL, NULL, 'dc3674628d01e0fa7b79916ceb25e9e9caab652092f0335de1fe4ef5c1164b10abf471fdf35ac2dc981a3d702a536aa3751195d377333dda657726ddb22e800e', 0, NULL, 'jonas@stixy.com', NULL)
---
  def create
    @user_session = UserSession.new(params[:user_session])
    if @user_session.save