app/controllers/welcome_controller.rb

  def index
    @current_courses = Course.current.find(:all, :limit => 4)
    @planned_courses = Course.planned.find(:all, :limit => 4)
    @sessions = Session.current.active(true).asc.all(:limit => 5)
---
SELECT * FROM `courses` WHERE (`courses`.`id` = 1)
SELECT * FROM `courses`